## Utilizando las hojas de trucos de Pandas, complete cada uno de los ejercicios de pruebas.

###### La biblioteca de Pandas se basa en NumPy y proporciona estructuras de datos y herramientas de análisis de datos para Python lenguaje de programación.

##### Use the following import convention:

In [27]:
import pandas as pd

##### Estructuras de datos de Pandas
##### Serie

Una matriz etiquetada unidimensional a
capaz de contener cualquier tipo de datos

In [28]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

### DataFrame

In [29]:
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasília'],
        'Population': [11190846, 1303171035, 207847528]}

In [30]:
df = pd.DataFrame(data,
columns=['Country', 'Capital', 'Population']) 
print(df)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### Leer y escribir en CSV

In [34]:
#leemos el fichero en tipo csv
#pd.read_csv('file.csv', header=None, nrows=5)
#df.to_csv('myDataFrame.csv')
pd.read_csv('datos_rrss_t1.csv')

      Nombre  Cantidad     ES_FBK  Anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010
3    YouTube      2000      FALSO  2005
4   LinkedIn       663      FALSO  2003
5   WhatsApp      1600  VERDADERO  2009

In [35]:
df.to_csv('myDataFrame.csv')

### Leer y escribir en Excel

In [39]:
pd.read_excel('datos_rrss.xlsx')

      Nombre  Cantidad  ES_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

In [41]:
path = 'datos_rrss.xlsx'

#Leer y escribir en Excel
pd.read_excel('datos_rrss.xlsx')
#pd.to_excel('dir/myDataFrame.xlsx', sheet_name='Sheet1')

      Nombre  Cantidad  ES_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

### Leer varias hojas del mismo archivo

In [42]:
#xlsx = pd.ExcelFile('datos_rrss.xlsx')
#df = pd.read_excel(sheet_name='hoja2')
pd.read_excel('datos_rrss.xlsx',
             sheet_name='Hoja2')

      Nombre  Cantidad  ES_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010

### Pidiendo ayuda

In [13]:
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
        Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=['cobra', 'viper', 'sidewinder'],
    ...      columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...        index=['viper', 'sidewinder', 'cobra'])]
                max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...    ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...         [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

#### Selección

#### Obtener

In [14]:
s['b']

-5

In [15]:
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

### Selección, indexación booleana y configuración

##### Por posición

In [47]:
df.iloc[0]
df.iloc[0,0]

'Belgium'

In [48]:
df.iat[0,0]

'Belgium'

#### Por etiqueta

In [49]:
df.loc[0, 'Country']

'Belgium'

In [50]:
df.at[0, 'Country']

'Belgium'

### Por etiqueta / posición

In [51]:
df.loc[2]

Country          Brazil
Capital        Brasília
Population    207847528
Name: 2, dtype: object

In [52]:
df.loc[:,'Capital']

0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object

In [53]:
df.loc[1,'Capital']

'New Delhi'

### Indexacion booleana

In [54]:
s[~(s > 1)]

b   -5
dtype: int64

In [55]:
s[(s < -1) | (s > 2)]

a    3
b   -5
c    7
d    4
dtype: int64

In [56]:
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

## Leer y escribir en una tabla de base de datos o consulta SQL

In [57]:
from sqlalchemy import create_engine

In [58]:
 engine = create_engine('sqlite:///:memory:')

## Goteante

In [62]:
s.drop(['a', 'c']) #Eliminar valores de filas (eje = 0)

b   -5
d    4
dtype: int64

In [61]:
df.drop ('Country', axis = 1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

## Sort & Rank

In [63]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [64]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [65]:
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

### Recuperación de información de series / marcos de datos

In [73]:
df.shape ###(filas, columnas)

(3, 3)

In [68]:
df.index ### Describe el índice

RangeIndex(start=0, stop=3, step=1)

In [69]:
df.columns ### Describe las columnas de DataFrame

Index(['Country', 'Capital', 'Population'], dtype='object')

In [70]:
df.info () ### Información sobre DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [71]:
df.count ()

Country       3
Capital       3
Population    3
dtype: int64

### Resumen

In [95]:
df.sum () ### Suma de valores

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [76]:
df.cumsum () ### suma acumulativa de valores

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [78]:
df.min ()
df.max () ### valores minimos/maximos

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [83]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [84]:
df.mean()

Population    5.074031e+08
dtype: float64

In [85]:
df.median()

Population    207847528.0
dtype: float64

### Aplicar funciones

In [86]:
f = lambda x: x*2

In [87]:
df.apply(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

In [88]:
df.applymap(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

## Alineación de datos

### Alineación de datos internos

In [89]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])

In [90]:
s + s3

a    10.0
b     NaN
c     5.0
d     7.0
dtype: float64

### Operaciones aritméticas con métodos de relleno

In [91]:
s.add(s3, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     7.0
dtype: float64

In [92]:
s.sub(s3, fill_value=2)

a   -4.0
b   -7.0
c    9.0
d    1.0
dtype: float64

In [93]:
s.div(s3, fill_value=4)

a    0.428571
b   -1.250000
c   -3.500000
d    1.333333
dtype: float64

In [94]:
s.mul(s3, fill_value=3)

a    21.0
b   -15.0
c   -14.0
d    12.0
dtype: float64